Broman3100/STM32F103C8-Access-controller/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2022 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "string.h"
#include "stdbool.h"
/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define Wipe_Btn_Pin GPIO_PIN_1
#define Wipe_Btn_GPIO_Port GPIOA
#define Manager_Btn_Pin GPIO_PIN_2
#define Manager_Btn_GPIO_Port GPIOA
#define W2_1_Pin GPIO_PIN_12
#define W2_1_GPIO_Port GPIOB
#define W2_1_EXTI_IRQn EXTI15_10_IRQn
#define W2_0_Pin GPIO_PIN_13
#define W2_0_GPIO_Port GPIOB
#define W2_0_EXTI_IRQn EXTI15_10_IRQn
#define W1_1_Pin GPIO_PIN_14
#define W1_1_GPIO_Port GPIOB
#define W1_1_EXTI_IRQn EXTI15_10_IRQn
#define W1_0_Pin GPIO_PIN_15
#define W1_0_GPIO_Port GPIOB
#define W1_0_EXTI_IRQn EXTI15_10_IRQn
#define Door_Btn_Pin GPIO_PIN_8
#define Door_Btn_GPIO_Port GPIOA
#define Door_Btn_EXTI_IRQn EXTI9_5_IRQn
#define RelayP_Pin GPIO_PIN_10
#define RelayP_GPIO_Port GPIOA
#define RelayM_Pin GPIO_PIN_11
#define RelayM_GPIO_Port GPIOA
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
